app/Models/CustomerModel.php

SELECT *
FROM `customers`
WHERE LOWER(name) LIKE '%%' ESCAPE '!'
ORDER BY `name` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `customers`
WHERE LOWER(name) LIKE '%%' ESCAPE '!'
---
    public function search_data($search)
    {
        $query = $this->like('LOWER(name)', strtolower($search));
        $query = $query->orderBy('name', 'ASC');
        return $query->paginate(5, 'customers');