app/Models/ItemModel.php

SELECT *
FROM `items`
WHERE LOWER(name) LIKE '%%' ESCAPE '!'
OR  LOWER(price) LIKE '%%' ESCAPE '!'
OR  LOWER(publisher) LIKE '%%' ESCAPE '!'
ORDER BY `name` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE LOWER(name) LIKE '%%' ESCAPE '!'
OR  LOWER(price) LIKE '%%' ESCAPE '!'
OR  LOWER(publisher) LIKE '%%' ESCAPE '!'
---
    public function search_data($search)
    {
        $query = $this->like('LOWER(name)', strtolower($search));
        $query = $query->orLike('LOWER(price)', strtolower($search));
        $query = $query->orLike('LOWER(publisher)', strtolower($search));
        $query = $query->orderBy('name', 'ASC');
        return $query->paginate(5, 'items');