app/Models/PurchaseModel.php

SELECT `purchases`.*, `suppliers`.`name` AS `supplier_name`
FROM `purchases`
JOIN `suppliers` ON `suppliers`.`id` = `purchases`.`supplier_id`
---
    public function get_all_data()
    {
        $query = $this->join('suppliers', 'suppliers.id = purchases.supplier_id');
        $query = $query->select('purchases.*, suppliers.name AS supplier_name');
        return $query->get()->getResult();