app/Models/SaleModel.php

SELECT `sales`.*, `customers`.`name` AS `customer_name`
FROM `sales`
JOIN `customers` ON `customers`.`id` = `sales`.`customer_id`
---
    public function get_all_data()
    {
        $query = $this->join('customers', 'customers.id = sales.customer_id');
        $query = $query->select('sales.*, customers.name AS customer_name');
        return $query->get()->getResult();