app/Models/SupplierModel.php

    public function search_data($search)
    {
        $query = $this->like('LOWER(name)', strtolower($search));
        $query = $query->orderBy('name', 'ASC');
        return $query->paginate(5, 'suppliers');
---
SELECT *
FROM `suppliers`
WHERE LOWER(name) LIKE '%%' ESCAPE '!'
ORDER BY `name` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `suppliers`
WHERE LOWER(name) LIKE '%%' ESCAPE '!'