app/Models/UserModel.php

    public function get_data($id)
    {
        return $this->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function search_data($search)
    {
        $query = $this->like('LOWER(name)', strtolower($search));
        $query = $query->orLike('LOWER(email)', strtolower($search));
        $query = $query->orderBy('name', 'ASC');
        return $query->paginate(5, 'users');
---
SELECT *
FROM `users`
WHERE LOWER(name) LIKE '%%' ESCAPE '!'
OR  LOWER(email) LIKE '%%' ESCAPE '!'
ORDER BY `name` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE LOWER(name) LIKE '%%' ESCAPE '!'
OR  LOWER(email) LIKE '%%' ESCAPE '!'

    public function auth_user($email, $password)
    {
        $query = $this->where('LOWER(email)', strtolower(trim($email)));
        $result = $query->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE LOWER(email) = 'karunia@gmail.com'